#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e5102e5d2d2131c1ac7fb35ff1be271b" -> "51b250a1b1dd600db75b4bec42652195"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "7c4b49ebe9e5c3df769531d7e687479a" -> "66d11730ff71ee35d3e0c88104624df2"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bd35d83cef6116721aedec1af50aaaa7" -> "9294f00baa1a581d626e430fedc59551"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "47b93eaf9ac49534768ccb7569331a86" -> "84e19aaa86f5b2199db75fd1e57b8f53"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "401716f362658cc86f46577cdf4f99d2" -> "a45f50617a9303d84633ee24a2298ce9"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "8fdbfb0f806ef72108c7a531a256df8f" -> "b3e1738ddb08cb2d67ae637eb72ccfcc"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "516d79243354d0e72f6c6811da67d9f8" -> "fe105ea58a8da70d970ac31eb735c61b"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "b31281b5521bb25d85fcac0c95914b92" -> "475f363ccd8edcf810314c10022a39d4"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "cc1bc2f34d920326b33acc97aadf091f" -> "994fb2d24cbc33a4f6014fe4bc05c67e"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "ff603748c2d6c71f7a18f4c029a33f47" -> "139aa4cfee7e98f38ddaa0ed03609957"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "33c2622c2f09fb1c1a83a958ef41582b" -> "1c1226d4f8a178accfc8a2ea91e17310"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "8704b87ee98b96d264223303cbdc6458" -> "4a3abf73ead9d87810c5d062fa133041"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c05aed5a3557873633e971ed79dd2fbe" -> "e335f33e2e45af1cd90bf249c08248ac"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "f13b9f2c869c48b7919217b8cbe8ff0f" -> "7be7a1ab2051ab42dc263dcb4389265a"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "8d46fdbe3d3677f41aa85b3f2499c790" -> "6d4cac6ea0fe84893277ade1915fad96"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "446c8a25757a78de7151a445c85087a3" -> "4c69f2b46bea5243b607ba0f3f1d0df4"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "95ed55165ee0e705aa583572ced54e85" -> "62990e4c7a4a96f640ef823ea46cf178"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be created
  + resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "3661c6f4ac2fead477381e7611a6b229"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_all_ranges_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_all_ranges_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "7ba6cb08dadd42f613b4c1c5682c7187" -> "c7e300a1a33a6bfb8cb5d284d3937163"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "3dc167bbe834c3b5ef3f248fcedefe7a" -> "8336c77a574d5556afce276a68a17b12"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "bd2cfac8e30be6943a716c25cba4a76f" -> "62a8b85811a510796b075297208d8c0c"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "461dec0e7fab40daad6e4b7e849ca8f9" -> "9a5d2131d2c9c01a365548b50c25e891"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "f840bc1c0243a2a8ee6a0c247ef01d56" -> "3c59bb1aa31b0cf5619451051c1c041e"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "541cf38eb339a11f361b89dc5297eeaf" -> "1fc39a285642e7685e50f256f4048689"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "72b383a9fb7c76f1b0917b0d3e502d6e" -> "1385a9512f0e2627e8af350dec8f4e08"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "551266ef506784ab14a157df2878c91f" -> "b7187047b009adc8e0afd59b7c220041"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e9002274c19e84daa709d655bd71f994" -> "153b7939e84c4d5a9ddf94143d24f282"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "e4c35268c94f27a4b5c1b2802267574f" -> "c60798642a6fed5adfea139dc14fbe27"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "473e502195dbc8ee8e6e41808f2a380f" -> "97376666d7d7a89936a8c1533a49cb1e"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "543a3d9a58f7df27c7e1fcccef060405" -> "97292b643ffdb83d4bf3e8a3593ea3aa"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "ce6ef02520743aa51b750c7b1b5715d9" -> "125fd9b47b4a084fd20a215a7ecefffd"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "05b1411d17444ec54992d6cc667049cd" -> "a9897474d8339599bf836820e7d75fff"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "1a57ebe72827130e59a5e5f25ce0f9db" -> "98ddd77be0cdecbd1036555504d89666"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6a8ddb3f12daf1739cea91dca005128b" -> "daab56131ad465e56b44abad849c359f"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a4764ea5fe5e06796de976dc94bae7f8" -> "a5b0fac226efb4a2c590516a8a9d1bdb"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "08ec8493fa1cfeb105e3574738f3d7ff" -> "ec74eac56a7b221963203c8143cb9205"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "f154faab5b009454e797d9eb3982ebb9" -> "88a60541ae2b580c697dbdccfca3d7e9"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0e027d47705720d54c82bbc297831eb8" -> "eecbc71963b9b26453b6a4609f7eab38"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "c7dd560f367ece5ace365baf143dcdd2" -> "f93ba5be85ddf9fcabf1a4932b29d871"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "f057c779bb8f7dfb1e17122e68ba6b54" -> "e32b8627d4ae3e74fb857d1c60ac9d06"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "20bf69ab8d839ab4a954dd43dcc48378" -> "73a0ac4f305ae2b899036fc130ebecdb"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "97a41b847a3a1084c0f8648e50cbf8af" -> "16d3453f423823d1c780b5d7e3cc6c05"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "e33738e04ef47a78aaa14d575d51bb7d" -> "7acae3b9989ec0649483c78242a01fc9"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "H+/ZDTtxe1whMZloZOeitkC9AmBkQSbYve32Vbu8Hfk=" -> "p+Q/FRMP0ruVX6pb5a7vYeG+RdIzA2llNN+t/Hzv0qM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "04uCD0JmvzGjj508uB6X+md+dTMb+C0fGG/lkOKMG+c=" -> "WMwQX3TWrf6X6nuOpgUoAA5vlgHAZgFFayXpLIz1wvs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmUGEJKjvTAeHIBQZO+4nj++mc4dpMAFi0vnXsdbqdo=" -> "wgh/JT69hvLCylImHryGrdc5G8NPUU7oBrNfw5t4RiY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "n6NnpOWdI+uLI+RneayaqpnVonsPvqOuGVk6mEtVth0=" -> "KDVVbOGlB7AyH1MkNrP1x4BeAQWkDSLOlZLtYxeu63o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "5VZuMdNpXQ7YoYYK47Lg0LNHl5505NHAEwh4sbvbwag=" -> "efJerQhtMpl6hkGtqzxrcrCPAXRe9O9qZjfpmdLtWr0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWly7tWQihHRjRIXPSis3RJm38Wem5JgfhrkBlFwJlw=" -> "2sGxkGLv7GbFUeUkPRjKzekT3lHsOX7RT6hVvzwpzts="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "HPAzrTZOJjEPsiIAsjzQU8iy2i786ZorlZkXLuAcSyQ=" -> "bHkfetiUxRKKdSTAfdSShzfX+H5H28CydZiRlSYWPaA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "DMeWtHMOC1BjUr3sefDJDWWS57Ap0dLNmrX1FG+s/LY=" -> "9C8pFlcNZumVGzPTmHx7wGIJALw1KSvXlgy8u2JMkKI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "DM0JZyLfsFnfrQgSRMbkuILgTvo3LNX9kit/Gi7ydew=" -> "NGM7lHueYJY13qpYQ/Q0PrPOAMW+Nluo+yyyQ5Wa05A="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "2+m+/cWQMUIKy+fo+4OB4K1l3ZxUp3dQp5XvksN9GMo=" -> "0tVO7aZ2qh4+Uo3IaW1yOQslQSIsKLdgNR3ghTs0ork="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVn3zj9jKUHuumGyNVW8BDeuN2ME4IgTHcMX2b9V2/4=" -> "5uC7zh/+EvD1Wje4U/rE9BXb/uxXyXxr/CTSF5uNAWo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "FbVFf9Vfc46LKIAnmyidkZS1GlYUHUoVV1RsT2cVnU4=" -> "tToGmBht7BYRyrOOJD2m+hRGUbvoH5+83VkuFGQ4e7E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFiltjCE0rvZUvV/taLDGzmFlskOemjhncrYZt22uHw=" -> "630m9fkwY1LaPrtm4FQ7n4/63zVeJjyN3GnXMC19S5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "1LYjOtKjdkSpFOzqIDIVSK/iXUFWv5KcQClBuKh09mg=" -> "CKl1ODfLtzSF7ovzdKptCF+4cfhYwevQFbjvJ/8JdVA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "PGCZn/GJ+XDG4Ba+YH8jDqAdcq58U58T6n3ckycj5To=" -> "j/ELqPgtwRA9XBf8iGpnZpJ8iz2zeb4VXoJjVzqgiuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "4f+A+bLRkHiTzElsAeI34OJxHRFqWtG5joZoocyeo+o=" -> "X++J1qvOImQorpp4eDO9Em7tQdy45ZyJfpTkBmMNZi4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "L5ktIsA1pAoOY9FmKjHpdiuKCyWSLFodRabjBWSFFpY=" -> "SApsJ1DkVrB4QTgDZLG6PDf0b680COIMwuQ/wxQN6+c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be created
  + resource "aws_lambda_function" "get_all_ranges_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_all_ranges_lambda_function"
      + handler                        = "get_all_ranges_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_all_ranges_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "ilAVqCPmidI8l3L7t3hLpBWegoOQ9zfSFb8ta02cpQ4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "oK9LG76YFtqihOwxWLDeYHwbR1EkW38NgrJjMGep5Z8=" -> "uLXgWfUgkDmnqqW9ekWe4fxiisn/svEyyw3hvNk1Bt0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "ak/hdCTLlXcH0S7SO/NvM8WuADNvMha3fGesitP4Xpo=" -> "O2uzsZ3NtQQgm/8j7as/SICvJW6GuJDUaDyrzSSumVw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcG9y34cDs2rt2HXEP123k0mAkdULR+eeTHbm0XVRP4=" -> "IKNjzEfA91uJ4ezSmQdHCeJtgF2kcOhxvZ2D26QQ7GQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "c89KlKJXkzSzCOngHZkphzt9Ud95QgyZ4oAP67zKCb0=" -> "4Druh9Z2uSp5vcMKKW1MQB+qtRjloJbBBtDHovU01wc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gco9t5wErgPIWRMDUn9z60QVIWBgEYOK60eXeXGUYlk=" -> "P5PPnHg1bHrOV/vIUHRa3Df/37LM1eBTtoCObuIVus0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "KnGmKfeOyYaHBb4LBaeoEJSKUXHhPOGzpvSmflDBb78=" -> "8c5MK3cuspCZuEF7oYcIMszRkxghlTw1Yf51Uz334tY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "mk3m3zh10FVYhCwjiOlVO3TA2wQbM6wKfOuGnHWeJeI=" -> "PokpF+T/5ES4EAjzGfFZDF5My0fD5jisWyKIME8f7vs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "2/JrsXk2/UUKz1PLt2GQge/mL1S/frdZVXGo65rz3s4=" -> "IfPgaLphd0yiS5Q9sxP/nV1NMn9Q5insL5TseH0O3f8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "00YWuo55g+VGYJjJhhfWqRTocuobo4bRDiWmjcUYzOs=" -> "zBwggr2dw2Pw0Mh5oLMt32ertHrl9rLQ+9/4pH9xOjg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "S16P6gOkGURhl7uZt7ntivb3idvbYv/ikAXZdU/AehU=" -> "ODBAWWRl8CjI+AKMe3s/430GMdYFpvjPqkdyAP7qzRI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "+ha4zL/gBSswYHPgYwRvzGCkwJ8aY+vvb7pjBq0efoo=" -> "qGpkx4XfNmkOSPv4EB6gdMpfghVSFvnuNB6/RUdKm+k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Xw5ld5fZ7Gm0/PgI5JrMXXK+M6lX/wt3nXDdpogp1DY=" -> "69s63FeS2dZS+gN+gsydP5jcgBs/YoPyjrUp3MSxnj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "lP5LhAFHF7N4maIK5UmYaQZfItEsXuKGyDh15PRY0wk=" -> "3XjqFw5D4/erWLKYMvkP2vXbVxeB4Sg7VongFParONg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWfwI4v62jcXu9xfFMoEmJYyr3TOTMldu/eY6u/Ting=" -> "mO3NulnKmgRz/uveLespZ7gnOX+WlCE5oa9I3glrRj4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DooeVwoiU35xN2SwSDJwhYpsP7haZEK1v4arJzY/KOk=" -> "6bDcH9A4P9uvpWCZgOic43+yrCqHzp4kSGxTwhoCnQs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "ER/m/qeQatL5+1SaiNcziiyLzgW7w/9EdfB5n27Xcvw=" -> "5L4cInKZYRorEZg6gK5jNvBW8aarFIac0mFeTtAu2Ns="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "ewmUcPgBC4DIF2ZBYGfunW0FWiURq9GQdWLcm9MCo2g=" -> "w5w3dCnrJBIOFxrI5DxfhE1ITk0eGuLJJ2Tmpdh25+o="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "amsBQTXjqo8zWeAOXSTIgOXUarQnN0/FUbQz8EjIVYs=" -> "MWnmCveGZEJMA39KyqeVq/3LIcZrp6CCSdleSRUn2DA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "2i85bqr31qP5Ri0lzArhBgJa4Jf8ep1stiAvws1EzsE=" -> "Q0iaP52FmPKAb2fam70+T+/sLhsemUatqUtVQzew1eA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "njqq9bXYrmKDA1Xccy6APCYJwWpJ4IdYtz4OSPEk7Ac=" -> "we/+Nhxvv1CiayBeV+qTFt9Rx9+Dk0vcfGXTL08u+6M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "9VVs4VrF88Ja1uyt9UZ/yeJOPzamTRe3nSt9HDv2bFs=" -> "hydAHQOgZ29YrhbvcxRrHn46JgV3rPAlkiK+Buttpp4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "HWUxgkDvYeAMhX/0npP8JeHmwQ27hoZ/hmRLKm5aupo=" -> "s0rxYQL5ObYjjBCBmdWB2FQ9n3Bsn+ZJ9NTFnaG0qbw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "wxZD1baRonwymXiwMjWb5Wv6hvagldj3TiV3xePJA+Q=" -> "26UGuc8kPkgKXdss27+Jc97PLLpBwMlaUFhtscIghBU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z2Gn7+c0WD9oEJruyK+iBoEDKWgKKSxw5lDbiacAttE=" -> "CEdfWhFjsJWHcLANSWwkCFkUOszZH83ySJF+Y5lArzE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-21T17:16:55Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "r57vbn" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-21T17:16:54Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_all_ranges_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_all_ranges_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_all_ranges_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_all_ranges_integration will be created
  + resource "aws_api_gateway_integration" "get_all_ranges_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_all_ranges_method will be created
  + resource "aws_api_gateway_method" "get_all_ranges_method" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = "3y14fs"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.limit"  = false
          + "method.request.querystring.offset" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.ranges will be created
  + resource "aws_api_gateway_resource" "ranges" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "ranges"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-21T17:17:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_all_ranges_lambda_exec_role will be created
  + resource "aws_iam_role" "get_all_ranges_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_all_ranges_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_all_ranges_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_all_ranges_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_all_ranges_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_all_ranges_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_all_ranges_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_all_ranges_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_all_ranges_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_all_ranges_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_all_ranges_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_all_ranges_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_all_ranges_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_all_ranges_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayGetAllRanges"
    }

Plan: 12 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*